[
  {
    "time": "12:43",
    "message": "Привет, Ревьювер",
    "isMy": false
  },
  {
    "time": "13:34",
    "message": "Не успел сдаться во время, ибо на работе слегка завал",
    "isMy": true
  },
  {
    "time": "12:43",
    "message": "Сейчас имею некий такой фреймворк на костылях, который выглядит аля-реакт)",
    "isMy": false
  },
  {
    "time": "14:35",
    "message": "Для каждого не html тега формируется свой компонент",
    "isMy": true
  },
  {
    "time": "15:43",
    "message": "Так-же у меня есть сторы на которые можно подписать компонент, чтобы он обновлялся при обновлении стора, получая state стора себе в props... Запутанно)",
    "isMy": false
  },
  {
    "time": "15:43",
    "message": "Роутер работает по той-же схеме, да и вообще мне очень понравился EventBus. Прям расширил мои горизонты",
    "isMy": false
  },
  {
    "time": "15:43",
    "message": "TS адекватно внедрить не удалось ((",
    "isMy": false
  },
  {
    "time": "14:35",
    "message": "Очень много времени потратил на допил своего шаблонизатора и на то, чтобы сдружить его с компонентом",
    "isMy": true
  },
  {
    "time": "14:35",
    "message": "Сделать взаимодействие с предоставленным api не вышло, не успеваю, по этому делаю эмуляцию",
    "isMy": true
  },
  {
    "time": "14:35",
    "message": "Как-то так :)",
    "isMy": true
  },
  {
    "time": "00:00",
    "message": "На netlify, к сожалению, редирект настроить не удалось :(, Но локально всё замечательно работает",
    "isMy": true
  },
  {
    "time": "00:00",
    "message": "Очень надеюсь эта реализация прокатит :)",
    "isMy": false
  },
  {
    "time": "00:00",
    "message": "Осталось 4 минуты до след недели, по этому заливаю, что есть. Вроде бы поправил все замечания кроме мока api. Не получилось, мок не подтягивался, вернул все в исходное состояние. На netlify приложение, возможно, не будет работать, ибо нужен именно мой сервер на ноде. Там идет образотка js файлов у которых не указано расширение",
    "isMy": false
  }
]
